import random
from portfolio.models import Student

# Список имен студентов
students_names = [
    "Вадим Лилеков", "Вероника Герджикова", "Всеволод Шкалдык", "Илья Машнер", 
    "Матвей Веселов", "Артур Файзуллин", "Хайруллин Булат", "Тима Фенек", 
    "Руслан Супроткин", "Роман Волынников", "Тимофей Данилов", "Александр Фролов", 
    "Бахадыр Расулов", "Макс Майер", "Гаджи Магомедов", "Atash Chop", 
    "Евгений Гнатюк", "Михайлов Миша", "Egor Demchenko", "Егор Гр", "Никита Беляев"
]

# Список факультетов
faculties = [
    "Факультет информационных технологий", "Транспортный факультет", 
    "Факультет машиностроения", "Факультет химической технологии и биотехнологии", 
    "Факультет урбанистики и городского хозяйства", "Факультет экономики и управления", 
    "Институт графики и искусства книги имени В. А. Фаворского (Высшая школа печати и медиаиндустрии)", 
    "Институт издательского дела и журналистики (Высшая школа печати и медиаиндустрии)", 
    "Полиграфический институт (Высшая школа печати и медиаиндустрии)"
]

for i in range(12):
    first_name, last_name = students_names[i].split()
    student = Student(
        first_name=first_name,
        last_name=last_name,
        university="Московский политех",
        faculty=random.choice(faculties),
        course_number=random.randint(2, 4) 
    )
    student.save()

print("12 студентов успешно созданы!")
